[net]
channels=3

# simple stem in
[convolutional]
filters=32
size=3
pad=1
stride=2
batch_normalize=1
activation=relu

# stage 1 (1/1)
# projection
[convolutional]
filters=48
size=1
stride=2
pad=1
batch_normalize=1
activation=linear

[route]
layers=-2

[convolutional]
filters=48
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=48
groups=2
size=3
stride=2
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=48
size=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-5
activation=relu

# stage 2 (1/3)
# projection
[convolutional]
filters=96
size=1
stride=2
pad=1
batch_normalize=1
activation=linear

[route]
layers=-2

[convolutional]
filters=96
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=96
groups=4
size=3
stride=2
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=96
size=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-5
activation=relu

# stage 2 (2/3)
[convolutional]
filters=96
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=96
groups=4
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=96
size=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

# stage 2 (3/3)
[convolutional]
filters=96
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=96
groups=4
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=96
size=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

# stage 3 (1/5)
# projection
[convolutional]
filters=240
size=1
stride=2
pad=1
batch_normalize=1
activation=linear

[route]
layers=-2

[convolutional]
filters=240
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=240
groups=10
size=3
stride=2
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=240
size=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-5
activation=relu

# stage 3 (2/5)
[convolutional]
filters=240
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=240
groups=10
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=240
size=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

# stage 3 (3/5)
[convolutional]
filters=240
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=240
groups=10
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=240
size=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

# stage 3 (4/5)
[convolutional]
filters=240
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=240
groups=10
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=240
size=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

# stage 3 (5/5)
[convolutional]
filters=240
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=240
groups=10
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=240
size=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

# stage 4 (1/7)
# projection
[convolutional]
filters=528
size=1
stride=2
pad=1
batch_normalize=1
activation=linear

[route]
layers=-2

[convolutional]
filters=528
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=528
groups=22
size=3
stride=2
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=528
size=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-5
activation=relu

# stage 4 (2/7)
[convolutional]
filters=528
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=528
groups=22
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=528
size=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

# stage 4 (3/7)
[convolutional]
filters=528
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=528
groups=22
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=528
size=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

# stage 4 (4/7)
[convolutional]
filters=528
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=528
groups=22
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=528
size=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

# stage 4 (5/7)
[convolutional]
filters=528
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=528
groups=22
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=528
size=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

# stage 4 (6/7)
[convolutional]
filters=528
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=528
groups=22
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=528
size=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

# stage 4 (7/7)
[convolutional]
filters=528
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=528
groups=22
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=528
size=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=relu

#########################

# detect large
# block 1
[convolutional]
filters=352
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=352
groups=22
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=352
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

# merge to middle 1
[upsample]
stride=2

[route]
layers = -1, 42

# block 2
[convolutional]
filters=176
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=176
groups=11
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=176
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

# merge to small 1
[upsample]
stride=2

[route]
layers = -1, 20

# block 3
[convolutional]
filters=96
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=96
groups=6
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=96
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=45
size=1
stride=1
pad=1
activation=linear

[yolo]
classes=10
ignore_thresh = .5
bbox_loss=l1
l1_loss_gain=0.05

[route]
layers = -3

# block 4
[convolutional]
filters=176
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=176
groups=11
size=3
stride=2
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=176
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

# merge to middle 2
[route]
layers = -1, -12

# block 5
[convolutional]
filters=176
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=176
groups=11
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=176
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=45
size=1
stride=1
pad=1
activation=linear

[yolo]
classes=10
ignore_thresh = .5
bbox_loss=l1
l1_loss_gain=0.05

[route]
layers = -3

# block 6
[convolutional]
filters=352
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=352
groups=22
size=3
stride=2
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=352
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

# merge to small 2
[route]
layers = -1, -27

# block 7
[convolutional]
filters=352
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=352
groups=22
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=352
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=45
size=1
stride=1
pad=1
activation=linear

[yolo]
classes=10
ignore_thresh = .5
bbox_loss=l1
l1_loss_gain=0.05